In [1]:
import numpy as np
import pandas as pd

# Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

- `dropna` Filter axis labels based on whether values for each label have missing data, with varying thresholds for how
much missing data to tolerate.
- `fillna` Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
- `isnull` Return boolean values indicating which values are missing/NA.
- `notnull` Negation of isnull

In [5]:
from numpy import nan as NA

In [ ]:
np.nan

#### Series

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [12]:
data[[0,2,4]]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

#### DF

In [13]:
data = pd.DataFrame([[1., NA, 3.], [1., 6, 7],[NA, NA, NA], [NA, NA, 3]])
data

     0    1    2
0  1.0  NaN  3.0
1  1.0  6.0  7.0
2  NaN  NaN  NaN
3  NaN  NaN  3.0

In [27]:
cleaned = data.dropna()
cleaned

     0    1    2
1  1.0  6.0  7.0

In [28]:
data.dropna(how='all')

     0    1    2
0  1.0  NaN  3.0
1  1.0  6.0  7.0
3  NaN  NaN  3.0

In [14]:
data = pd.DataFrame([[1., NA, 3.], [1., NA, 7],[NA, NA, NA], [NA, NA, 3]])

In [15]:
data

     0   1    2
0  1.0 NaN  3.0
1  1.0 NaN  7.0
2  NaN NaN  NaN
3  NaN NaN  3.0

In [16]:
data.dropna(axis=1, how='all')

     0    2
0  1.0  3.0
1  1.0  7.0
2  NaN  NaN
3  NaN  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.280985       NaN       NaN
1  1.492126       NaN       NaN
2  0.324354       NaN  0.326628
3  0.297550       NaN  0.031585
4  0.534947  0.415882 -0.906384
5  0.576056  0.720458  0.085342
6 -1.569772 -0.486910  0.043834

In [33]:
df.dropna()

          0         1         2
4 -0.219304  2.781263 -3.060557
5 -0.129438 -0.996677  0.182507
6 -0.185749  0.322128 -0.837439

# Filling In Missing Data

In [18]:
df.fillna(0)

          0         1         2
0 -1.280985  0.000000  0.000000
1  1.492126  0.000000  0.000000
2  0.324354  0.000000  0.326628
3  0.297550  0.000000  0.031585
4  0.534947  0.415882 -0.906384
5  0.576056  0.720458  0.085342
6 -1.569772 -0.486910  0.043834

##### Calling fillna with a dict, you can use a different fill value for each column:

In [22]:
df.columns = ['a','b','c']

In [23]:
df.fillna({'b': 0.5, 'c': 0})

          a         b         c
0 -1.280985  0.500000  0.000000
1  1.492126  0.500000  0.000000
2  0.324354  0.500000  0.326628
3  0.297550  0.500000  0.031585
4  0.534947  0.415882 -0.906384
5  0.576056  0.720458  0.085342
6 -1.569772 -0.486910  0.043834

#### fillna returns a new object, but you can modify the existing object in-place:

In [24]:
_ = df.fillna(0, inplace=True)
df

          a         b         c
0 -1.280985  0.000000  0.000000
1  1.492126  0.000000  0.000000
2  0.324354  0.000000  0.326628
3  0.297550  0.000000  0.031585
4  0.534947  0.415882 -0.906384
5  0.576056  0.720458  0.085342
6 -1.569772 -0.486910  0.043834

In [26]:
df = pd.DataFrame(np.random.randn(6, 3))
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.130168 -0.476489  0.494504
1 -0.992207  1.275340  1.342651
2 -0.144312       NaN -1.099853
3  1.207557       NaN -0.774660
4 -0.173722       NaN       NaN
5 -1.001390       NaN       NaN

In [41]:
df.fillna(method='ffill')

          0         1         2
0 -0.673021 -0.922327 -1.318941
1 -1.548608 -1.450818 -0.921162
2  1.061547 -1.450818  0.451806
3 -1.676752 -1.450818 -1.283596
4  0.718250 -1.450818 -1.283596
5  2.259418 -1.450818 -1.283596

In [28]:
df.fillna(method='ffill', limit=1)

          0         1         2
0 -0.130168 -0.476489  0.494504
1 -0.992207  1.275340  1.342651
2 -0.144312  1.275340 -1.099853
3  1.207557       NaN -0.774660
4 -0.173722       NaN -0.774660
5 -1.001390       NaN       NaN

In [29]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [32]:
data.fillna(data.max())

0    1.0
1    7.0
2    3.5
3    7.0
4    7.0
dtype: float64

- `value` Scalar value or dict-like object to use to fill missing values
- metho`d Interpolation; by default 'ffill' if function called with no other arguments
- `axis` Axis to fill on; default axis=0
- `inplace` Modify the calling object without producing a copy
- `limit` For forward and backward filling, maximum number of consecutive periods to fill

#  Data Transformation

### Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [5]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

# Transforming Data Using a Function or Mapping

In [7]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [8]:
meat_to_anima = ['bacon''pig','pullepork''pig','pastrami''cow','cornebeef''cow','honeham''pig','novlox''salmon']
meat_to_anima

['baconpig',
 'pulleporkpig',
 'pastramicow',
 'cornebeefcow',
 'honehampig',
 'novloxsalmon']

In [10]:
lowercased = data['food'].str.title()
lowercased

0          Bacon
1    Pulled Pork
2          Bacon
3       Pastrami
4    Corned Beef
5          Bacon
6       Pastrami
7      Honey Ham
8       Nova Lox
Name: food, dtype: object

### Replacing Values

In [12]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [13]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [14]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [70]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000: 0})

### Renaming Axis Indexes

In [15]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [18]:
a = lambda x1,x2: x1 +x2

In [19]:
a(1,2)

3

In [16]:
transform = lambda x: x[:4].upper()

In [20]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [73]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [74]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
'Ohio' == 'OHIO'

False

In [21]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

## Detecting and Filtering Outliers

In [30]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000612     0.047340     0.001016    -0.033793
std       1.019086     0.969593     1.016391     0.950642
min      -3.714560    -3.606988    -3.230537    -2.967917
25%      -0.698233    -0.603960    -0.659013    -0.645133
50%       0.014746     0.037302     0.041058    -0.062540
75%       0.694938     0.715487     0.669825     0.598742
max       2.862919     3.803921     3.229586     3.678921

In [31]:
col = data[2]
col

0     -1.289002
1     -0.666868
2      0.482424
3     -0.481906
4      0.951435
         ...
995    0.662070
996    0.278083
997   -1.388057
998    0.216941
999   -0.012000
Name: 2, Length: 1000, dtype: float64

In [32]:
np.abs(col)

0      1.289002
1      0.666868
2      0.482424
3      0.481906
4      0.951435
         ...
995    0.662070
996    0.278083
997    1.388057
998    0.216941
999    0.012000
Name: 2, Length: 1000, dtype: float64

In [33]:
(np.abs(col) > 3).sum()

3

In [34]:
np.abs(col) > 3

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: 2, Length: 1000, dtype: bool

In [28]:
col[np.abs(col) > 3]

300   -3.190763
595   -3.313099
596   -3.150116
Name: 2, dtype: float64

In [35]:
(np.abs(data) > 3)

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [83]:
(np.abs(data) > 3).any(1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [89]:
(np.abs(data) > 3).any(1).sum()

13

In [84]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
8    0.192529 -1.057532 -3.059989  1.016895
141  3.273389 -0.035244  0.295402 -0.024975
441 -3.877370  0.621438  0.034884 -0.235297
663  3.000728 -1.461098 -0.453945 -0.605884
691  0.338134 -3.474569 -0.370180  0.032152
713 -0.304152  3.348152 -0.500888 -0.772167
722 -1.361566 -0.604378  2.342956  4.239402
753 -0.914987  0.006443 -1.445280 -3.438535
760  0.876763 -3.400728 -0.240216  0.818483
763 -1.884497 -3.090421  1.771122  0.890987
900  0.975991 -1.136418 -2.116701 -3.068684
907  0.555190 -3.039973  0.986942 -1.709300
946  0.226072 -3.421086 -0.554227 -2.062447

# String Manipulation

### String Object Methods

In [91]:
val = 'a,b, guido'

val.split(',')

['a', 'b', ' guido']

In [36]:
'  tt'.strip()

'tt'

In [92]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [93]:
'::'.join(pieces)

'a::b::guido'

# Vectorized String Functions in pandas

In [37]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [38]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [39]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [ ]:
'1000-1012'

In [40]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [101]:
patter = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [102]:
data.str()